ArteryTek/AT32F403A_407_Firmware_Library/project/at_start_f403a/examples/sdio/sd_mmc_card/src/at32_sdio.c
    /* set transfer mode */
    status = sd_device_mode_set(SD_TRANSFER_DMA_MODE);
  }

  if(status == SD_OK)
  {
    /* Set data width */
    status = sd_wide_bus_operation_config(SDIO_BUS_WIDTH_D4);
  }

  return status;
}

/**
  * @brief  set sdio clock devision factor.
  * @param  clkdiv: sdio_ck = ahbclk / (clkdiv+2)
  * @retval none
  */
void sdio_clock_set(uint32_t clk_div)
{
  /* config clock divide [7:0] */
  SDIOx->clkctrl_bit.clkdiv_l = (clk_div & 0xFF);

  /* config clock divide [9:8] */
  SDIOx->clkctrl_bit.clkdiv_h = ((clk_div & 0x300) >> 8);
}

/**
  * @brief  enquires cards about their operating voltage and configures
  *         clock controls.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_power_on(void)
{
  uint8_t retry = 0;
  sd_error_status_type status = SD_OK;
  uint32_t response = 0, count = 0, valid_voltage = 0, clk_psc;
  uint32_t sd_type = SD_STD_CAPACITY;

  /* sdio_ck is less than 400KHz in initialization stage, set to 200KHz */
  clk_psc = (system_core_clock / 200000) - 2;

  if(clk_psc > 0x3FF)
  {
    clk_psc = 0x3FF;
  }

  /* config sdio clock divide and edge phase */
  sdio_clock_config(SDIOx, clk_psc, SDIO_CLOCK_EDGE_FALLING);
  /* config sdio bus width */
  sdio_bus_width_config(SDIOx, SDIO_BUS_WIDTH_D1);
  /* disable flow control */
  sdio_flow_control_enable(SDIOx, FALSE);
  /* disable clock bypass */
  sdio_clock_bypass(SDIOx, FALSE);
  /* disable power saving mode */
  sdio_power_saving_mode_enable(SDIOx, FALSE);

  /* sdio power on */
  sdio_power_set(SDIOx, SDIO_POWER_ON);
  /* enable to output sdio_ck */
  sdio_clock_enable(SDIOx, TRUE);
  delay_ms(10);
  
  for(retry = 0; retry < 5; retry++)
  {
    /* send cmd0, get in idle stage */
    sdio_command_init_struct.argument = 0x0;
    sdio_command_init_struct.cmd_index = SD_CMD_GO_IDLE_STATE;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_NO;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    /* get command status */
    status = command_error();
  }

  /* send cmd8, check card interface feature */
  sdio_command_init_struct.argument = SD_CHECK_PATTERN;
  sdio_command_init_struct.cmd_index = SDIO_SEND_IF_COND;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  /* waiting R7 */
  status = command_rsp7_error();

  if(status == SD_OK)
  {
    /* set card type and sd type */
    card_type = SDIO_STD_CAPACITY_SD_CARD_V2_0;
    sd_type = SD_HIGH_CAPACITY;
  }

  /* send cmd55, check sd version */
  sdio_command_init_struct.argument = 0x00;
  sdio_command_init_struct.cmd_index = SD_CMD_APP_CMD;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  /* waiting R1 */
  status = command_rsp1_error(SD_CMD_APP_CMD);

  /* check sd card or mmc card */
  if(SD_OK == status)
  {
    /* send acmd41, check voltage operation range */
    while((!valid_voltage) && (count < SD_MAX_VOLT_TRIAL))
    {
      delay_ms(10);

      /* send cmd55 before acmd41 */
      sdio_command_init_struct.argument = 0x00;
      sdio_command_init_struct.cmd_index = SD_CMD_APP_CMD;
      sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
      sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

      /* sdio command config */
      sdio_command_config(SDIOx, &sdio_command_init_struct);
      /* enable ccsm */
      sdio_command_state_machine_enable(SDIOx, TRUE);

      /* waiting R1 */
      status = command_rsp1_error(SD_CMD_APP_CMD);

      /* if any errors occured, return status */
      if(status != SD_OK)
      {
        return status;
      }

      /* send acmd41 */
      sdio_command_init_struct.argument = SD_VOLTAGE_WINDOW_SD | sd_type;
      sdio_command_init_struct.cmd_index = SD_CMD_SD_APP_OP_COND;
      sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
      sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

      /* sdio command config */
      sdio_command_config(SDIOx, &sdio_command_init_struct);
      /* enable ccsm */
      sdio_command_state_machine_enable(SDIOx, TRUE);

      /* waiting R3 */
      status = command_rsp3_error();

      /* if any errors occured, return status */
      if(status != SD_OK)
      {
        return status;
      }

      /* get response1 */
      response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

      /* check sd card power on stage is success or not */
      valid_voltage = (((response >> 31) == 1) ? 1 : 0);
      count++;
    }

    if(count >= SD_MAX_VOLT_TRIAL)
    {
      status = SD_INVALID_VOLTRANGE;
      return status;
    }

    if(response &= SD_HIGH_CAPACITY)
    {
      card_type = SDIO_HIGH_CAPACITY_SD_CARD;
    }
  }
  /* mmc card */
  else
  {
    /* send cmd1 */
    while((!valid_voltage) && (count < SD_MAX_VOLT_TRIAL))
    {
      delay_ms(10);

      sdio_command_init_struct.argument = SD_VOLTAGE_WINDOW_MMC;
      sdio_command_init_struct.cmd_index = SD_CMD_SEND_OP_COND;
      sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
      sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

      /* sdio command config */
      sdio_command_config(SDIOx, &sdio_command_init_struct);
      /* enable ccsm */
      sdio_command_state_machine_enable(SDIOx, TRUE);

      /* waiting R3 */
      status = command_rsp3_error();

      if(status != SD_OK)
      {
        return status;
      }

      /* get response1 */
      response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

      valid_voltage = (((response >> 31) == 1) ? 1 : 0);
      count++;
    }

