ArteryTek/AT32F403A_407_Firmware_Library/project/at_start_f403a/examples/sdio/sd_mmc_card/src/at32_sdio.c
    if(count >= SD_MAX_VOLT_TRIAL)
    {
      status = SD_INVALID_VOLTRANGE;
      return status;
    }

    card_type = SDIO_MULTIMEDIA_CARD;
  }

  return(status);
}

/**
  * @brief  turns the sdio output signals off.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_power_off(void)
{
  /* sdio power off */
  sdio_power_set(SDIOx, SDIO_POWER_OFF);

  return SD_OK;
}

/**
  * @brief  intialises all cards or single card as the case may be card(s) come
  *         into standby state.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_card_init(void)
{
  sd_error_status_type status = SD_OK;
  uint16_t rca_temp = 0x01;

  /* check power status */
  if(SDIO_POWER_OFF == sdio_power_status_get(SDIOx))
  {
    return SD_REQ_NOT_APPLICABLE;
  }

  /* check is secure_digital_io_card or not */
  if(SDIO_SECURE_DIGITAL_IO_CARD != card_type)
  {
    /* send cmd2, get cid register */
    sdio_command_init_struct.argument = 0x0;
    sdio_command_init_struct.cmd_index = SD_CMD_ALL_SEND_CID;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_LONG;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp2_error();
    if(status != SD_OK)
    {
      return status;
    }

    cid_table[0] = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);
    cid_table[1] = sdio_response_get(SDIOx, SDIO_RSP2_INDEX);
    cid_table[2] = sdio_response_get(SDIOx, SDIO_RSP3_INDEX);
    cid_table[3] = sdio_response_get(SDIOx, SDIO_RSP4_INDEX);
  }

  /* check card type */
  if((card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0) || \
     (card_type == SDIO_SECURE_DIGITAL_IO_COMBO_CARD) || (card_type == SDIO_HIGH_CAPACITY_SD_CARD))
  {
    /* send cmd3, get rca */
    sdio_command_init_struct.argument = 0x00;
    sdio_command_init_struct.cmd_index = SD_CMD_SET_REL_ADDR;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp6_error(SD_CMD_SET_REL_ADDR, &rca_temp);
    if(status != SD_OK)
    {
      return status;
    }
  }

  /* mmc card */
  if(card_type == SDIO_MULTIMEDIA_CARD)
  {
    /* send cmd3 */
    sdio_command_init_struct.argument = (uint32_t)(rca_temp << 16);
    sdio_command_init_struct.cmd_index = SD_CMD_SET_REL_ADDR;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp2_error();
    if(status != SD_OK)
    {
      return status;
    }
  }

  /* check is secure_digital_io_card or not */
  if(card_type != SDIO_SECURE_DIGITAL_IO_CARD)
  {
    rca = rca_temp;
    sdio_command_init_struct.argument = (uint32_t)(rca << 16);
    sdio_command_init_struct.cmd_index = SD_CMD_SEND_CSD;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_LONG;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp2_error();
    if(status != SD_OK)
    {
      return status;
    }

    csd_table[0] = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);
    csd_table[1] = sdio_response_get(SDIOx, SDIO_RSP2_INDEX);
    csd_table[2] = sdio_response_get(SDIOx, SDIO_RSP3_INDEX);
    csd_table[3] = sdio_response_get(SDIOx, SDIO_RSP4_INDEX);
  }

  return SD_OK;
}

/**
  * @brief  returns information about specific card.
  * @param  card_info: pointer to a sd_card_info_struct_type structure that contains all sd card
  *         information.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_card_info_get(sd_card_info_struct_type *card_info)
{
  sd_error_status_type status = SD_OK;
  uint8_t tmp = 0;

  card_info->card_type = (uint8_t)card_type;
  card_info->rca = (uint16_t)rca;

  /* byte 0 */
  tmp = (uint8_t)((csd_table[0] & 0xFF000000) >> 24);
  card_info->sd_csd_reg.csd_struct = (tmp & 0xC0) >> 6;
  card_info->sd_csd_reg.spec_version = (tmp & 0x3C) >> 2;
  card_info->sd_csd_reg.reserved1 = tmp & 0x03;

  /* byte 1 */
  tmp = (uint8_t)((csd_table[0] & 0x00FF0000) >> 16);
  card_info->sd_csd_reg.taac = tmp;

  /* byte 2 */
  tmp = (uint8_t)((csd_table[0] & 0x0000FF00) >> 8);
  card_info->sd_csd_reg.nsac = tmp;

  /* byte 3 */
  tmp = (uint8_t)(csd_table[0] & 0x000000FF);
  card_info->sd_csd_reg.max_bus_clk_freq = tmp;

  /* byte 4 */
  tmp = (uint8_t)((csd_table[1] & 0xFF000000) >> 24);
  card_info->sd_csd_reg.card_cmd_classes = tmp << 4;

  /* byte 5 */
  tmp = (uint8_t)((csd_table[1] & 0x00FF0000) >> 16);
  card_info->sd_csd_reg.card_cmd_classes |= (tmp & 0xF0) >> 4;
  card_info->sd_csd_reg.max_read_blk_length = tmp & 0x0F;

  /* byte 6 */
  tmp = (uint8_t)((csd_table[1] & 0x0000FF00) >> 8);
  card_info->sd_csd_reg.part_blk_read = (tmp & 0x80) >> 7;
  card_info->sd_csd_reg.write_blk_misalign = (tmp & 0x40) >> 6;
  card_info->sd_csd_reg.read_blk_misalign = (tmp & 0x20) >> 5;
  card_info->sd_csd_reg.dsr_implemented = (tmp & 0x10) >> 4;
  card_info->sd_csd_reg.reserved2 = 0; /* reserved */

  if((card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0) || (card_type == SDIO_MULTIMEDIA_CARD))
  {
    card_info->sd_csd_reg.device_size = (tmp & 0x03) << 10;

