ArteryTek/AT32F403A_407_Firmware_Library/project/at_start_f403a/examples/sdio/sd_mmc_card/src/at32_sdio.c
  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  if(SD_ALLZERO == (response & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_CMD_CRC_ERROR)))
  {
    *prca = (uint16_t)(response >> 16);
    return status;
  }

  if(response & SD_R6_GENERAL_UNKNOWN_ERROR)
  {
    return SD_GENERAL_UNKNOWN_ERROR;
  }

  if(response & SD_R6_ILLEGAL_CMD)
  {
    return SD_ILLEGAL_CMD;
  }

  if(response & SD_R6_CMD_CRC_ERROR)
  {
    return SD_CMD_CRC_ERROR;
  }

  return status;
}

/**
  * @brief  enable or disable the sdio wide bus mode.
  * @param  new_state: new state of the sdio wide bus mode. (true or false)
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_bus_wide_enable(confirm_state new_state)
{
  sd_error_status_type status = SD_OK;
  uint32_t response = 0;
  uint8_t arg = 0x00;

  if(new_state == TRUE)
  {
    arg = 0x02;
  }
  else
  {
    arg = 0x00;
  }

  /* get response1 */
  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked or not */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }

  if(sd_card_info.sd_scr_reg.sd_bus_width)
  {
    sdio_command_init_struct.argument = (uint32_t)(sd_card_info.rca << 16);
    sdio_command_init_struct.cmd_index = SD_CMD_APP_CMD;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_APP_CMD);

    if(status != SD_OK)
    {
      return status;
    }

    sdio_command_init_struct.argument = arg;
    sdio_command_init_struct.cmd_index = SD_CMD_APP_SD_SET_BUSWIDTH;
    sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
    sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_APP_SD_SET_BUSWIDTH);
    return status;
  }
  else
  {
    return SD_REQ_NOT_APPLICABLE;
  }
}

/**
  * @brief  switch mmc card speed to high speed
  * @param  set: new state of the sdio wide bus mode.
  * @param  index: offset.
  * @param  value: expect speed.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type mmc_switch(uint8_t set, uint8_t index, uint8_t value)
{
  sd_error_status_type status = SD_OK;
  uint32_t card_status = 0, timeout = 0;

  sdio_command_init_struct.argument = (EXT_CSD_Write_byte << 24) | (index << 16) | (value << 8) | set;
  sdio_command_init_struct.cmd_index = SD_CMD_HS_SWITCH;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(SD_CMD_HS_SWITCH);
  if(status != SD_OK)
  {
    return status;
  }

  card_status = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);
  if(card_status & MMC_SWITCH_ERROR)
  {
    return SD_SWITCH_ERROR;
  }

  timeout = SD_DATATIMEOUT;
  do
  {
    timeout--;
    status = sd_status_send(&card_status);
  } /* check ready_for_data flag */
  while(((card_status & 0x00000100) == 0) && (timeout > 0));

  if(timeout == 0)
  {
    return SD_ERROR;
  }

  return status;
}

/**
  * @brief  switch sd card speed to high speed
  * @param  mode: polling mode or dma mode
  * @param  group: selected group
  * @param  value: wanted speed
  * @param  rsp: switch status
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_switch(uint32_t mode, uint32_t group, uint8_t value, uint8_t *rsp)
{
  sd_error_status_type status = SD_OK;
  uint8_t power;
  uint16_t blk_size;

  if(rsp == NULL)
  {
    return SD_INVALID_PARAMETER;
  }

  SDIOx->dtctrl = 0x0;

  blk_size = 64;
  power = convert_from_bytes_to_power_of_two(blk_size);

  sdio_command_init_struct.argument =  blk_size;
  sdio_command_init_struct.cmd_index = SD_CMD_SET_BLOCKLEN;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(SD_CMD_SET_BLOCKLEN);

  if(status != SD_OK)
  {
    return status;
  }

  sdio_data_init_struct.block_size = (sdio_block_size_type)(power);
  sdio_data_init_struct.data_length = blk_size ;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CONTROLLER;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  sdio_command_init_struct.argument = (mode << 31) | 0x00FFFFFF;
  sdio_command_init_struct.argument &= ~(0xF << (group * 4));
  sdio_command_init_struct.argument |= value << (group * 4);
  sdio_command_init_struct.cmd_index = SD_CMD_HS_SWITCH;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  stop_flag = 0;

  return sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)rsp);
}

/**
  * @brief  checks if the sd card is in programming state.
  * @param  p_status: pointer to the variable that will contain the sd card state.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type check_card_programming(uint8_t *p_status)
{
  volatile uint32_t response = 0, sts_reg = 0, rsp_cmd = 0;

  /* send cmd13 */
  sdio_command_init_struct.argument = (uint32_t)(rca << 16);
  sdio_command_init_struct.cmd_index = SD_CMD_SEND_STATUS;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

